# Create Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleSheetInstance..::..Create Method
PanelScheduleSheetInstance Class See Also
---
Creates a new instance of panel schedule on sheet and adds it to the document.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static PanelScheduleSheetInstance Create(
	Document ADoc,
	ElementId scheduleId,
	View DBView
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	ADoc As Document, _
	scheduleId As ElementId, _
	DBView As View _
) As PanelScheduleSheetInstance
```

Visual C++
---
```text
public:
static PanelScheduleSheetInstance^ Create(
	Document^ ADoc,
	ElementId^ scheduleId,
	View^ DBView
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document
scheduleId
    Type: Autodesk.Revit.DB..::..ElementId
DBView
    Type: Autodesk.Revit.DB..::..View
# ### Return Value
The newly created panel schedule sheet instance element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace